ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/api_addItem_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
	<soapenv:Header>
		<ebl:RequesterCredentials>
			<!--Optional: -->
			<ebl:eBayAuthToken>%s(authToken)</ebl:eBayAuthToken>
		</ebl:RequesterCredentials>
	</soapenv:Header>
	<soapenv:Body>
		<ebl:AddItemRequest>
			<ebl:Item>
				<ebl:Title>%s(addItemTitle)</ebl:Title>
				<ebl:Description>The timeless classic by Martin Wickramasinghe.
					Brand
					new.
				</ebl:Description>
				<ebl:PrimaryCategory>
					<ebl:CategoryID>377</ebl:CategoryID>
				</ebl:PrimaryCategory>
				<ebl:StartPrice>1.00</ebl:StartPrice>
				<ebl:CategoryMappingAllowed>true</ebl:CategoryMappingAllowed>
				<ebl:Country>US</ebl:Country>
				<ebl:Currency>USD</ebl:Currency>
				<ebl:DispatchTimeMax>3</ebl:DispatchTimeMax>
				<ebl:ListingDuration>Days_7</ebl:ListingDuration>
				<ebl:ListingType>Chinese</ebl:ListingType>
				<ebl:PaymentMethods>PayPal</ebl:PaymentMethods>
				<ebl:PayPalEmailAddress>%s(paypalEmailAddress)
				</ebl:PayPalEmailAddress>
				<ebl:PictureDetails>
					<ebl:PictureURL>http://i1.sandbox.ebayimg.com/03/i/00/6b/63/03_1.JPG?set_id=8800005007
					</ebl:PictureURL>
				</ebl:PictureDetails>
				<ebl:PostalCode>95125</ebl:PostalCode>
				<ebl:Quantity>1</ebl:Quantity>
				<ebl:ShippingDetails>
					<ebl:ShippingType>Flat</ebl:ShippingType>
					<ebl:ShippingServiceOptions>
						<ebl:ShippingServicePriority>1</ebl:ShippingServicePriority>
						<ebl:ShippingService>USPSMedia</ebl:ShippingService>
						<ebl:ShippingServiceCost>2.50</ebl:ShippingServiceCost>
					</ebl:ShippingServiceOptions>
				</ebl:ShippingDetails>
				<ebl:ReturnPolicy>
					<ebl:ReturnsAcceptedOption>ReturnsAccepted</ebl:ReturnsAcceptedOption>
					<ebl:RefundOption>MoneyBack</ebl:RefundOption>
					<ebl:ReturnsWithinOption>Days_30</ebl:ReturnsWithinOption>
					<ebl:Description>%s(refundDescription)</ebl:Description>
					<ebl:ShippingCostPaidByOption>Buyer</ebl:ShippingCostPaidByOption>
				</ebl:ReturnPolicy>
				<ebl:Site>US</ebl:Site>
				<ebl:UUID>%s(uuid)</ebl:UUID>
			</ebl:Item>
			<ebl:Version>%s(version)</ebl:Version>
		</ebl:AddItemRequest>
	</soapenv:Body>
</soapenv:Envelope>